Repository: pingfangx/TranslatorX-other
Catalog: Kotlin/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Set a breakpoint at the line where the emit() function is called:
zh_cn: 在调用 emit() 函数的行上设置断点：

source: Set a new breakpoint at println(value).
zh_cn: 在 println(value) 上设置新的断点。

source: Set breakpoints at the lines with the println() function call:
zh_cn: 在带有 println() 函数调用的行上设置断点：

source: Shared mutable state and concurrency
zh_cn: 共享可变状态和并发性

source: Since all the coroutines are launched in the scope of the main runBlocking coroutine we don't have to keep an explicit list of all the coroutines we have started.
zh_cn: 因为所有的协程都是在主 runBlocking 协程的范围内启动的，所以我们不必保留一个明确的列表来保存我们已经启动的所有协程。

source: Some solutions to this problem in the land of coroutines are similar to the solutions in the multi-threaded world, but others are unique.
zh_cn: 在协程领域，这个问题的一些解决方案与多线程世界中的解决方案类似，但其他一些解决方案是独一无二的。

source: Table of contents
zh_cn: 目录

source: Take a look at the behavior of the following code:
zh_cn: 看一下以下代码的行为：

source: The "ping" coroutine is started first, so it is the first one to receive the ball.
zh_cn: “ping”协程先开始，所以它是第一个接到球的人。

source: The SupervisorJob can be used for these purposes.
zh_cn: SupervisorJob 可用于这些目的。

source: The Coroutines tab contains information on running or suspended coroutines.
zh_cn: Coroutines 选项卡包含有关正在运行或挂起的协程的信息。

source: The Debug tool window appears.
zh_cn: 出现 Debug 工具窗口。

source: The Debug tool window appears:
zh_cn: 出现 Debug 工具窗口：

source: The Frames tab contains the call stack.
zh_cn: Frames 选项卡包含调用栈。

source: The Variables tab contains variables in the current context.
zh_cn: Variables 选项卡包含当前上下文中的变量。

source: The src directory contains Kotlin source files and resources.
zh_cn: src 目录包含 kotlin 源文件和资源。

source: The main.kt file contains sample code that will print Hello World!.
zh_cn: main.kt 文件包含将打印 Hello World! 的示例代码。

source: The buffer() function buffers emitted values from the flow.
zh_cn: buffer() 函数缓冲从流中发出的值。

source: The JS and Native restrictions are temporary and will be lifted in the future.
zh_cn: JS 和 Native 限制是暂时的，将在未来取消。

source: The channels shown so far had no buffer.
zh_cn: 目前显示的通道没有缓冲区。

source: The coroutine had already completed with the corresponding exception when the handler is called.
zh_cn: 调用处理程序时，协程已经完成，但出现了相应的异常。

source: The emitter coroutine has the RUNNING status, and the collector coroutine has the SUSPENDED status.
zh_cn: 发射器协程具有 RUNNING 状态，收集器协程具有 SUSPENDED 状态。

source: The first coroutine has the SUSPENDED status – it is waiting for the values so it can multiply them.
zh_cn: 第一个协程的状态为 SUSPENDED，它正在等待值，以便将它们相乘。

source: The first four elements are added to the buffer and the sender suspends when trying to send the fifth one.
zh_cn: 前四个元素被添加到缓冲区中，发送者在尝试发送第五个元素时挂起。

source: The first one has the RUNNING status, and the other two have the CREATED status.
zh_cn: 第一个具有 RUNNING 状态，另外两个具有 CREATED 状态。

source: The first step of using an actor is to define a class of messages that an actor is going to process.
zh_cn: 使用 actor 的第一步是定义 actor 将要处理的一类消息。

source: The flow collector and emitter run in separate coroutines because of the buffer() function.
zh_cn: 由于使用了 buffer() 函数，流收集器和发射器在单独的协程中运行。

source: The following example does it like that, running each coroutine in the single-threaded context to start with.
zh_cn: 下面的示例就是这样做的，首先在单线程上下文中运行每个协程。

source: The following example prints the first ten prime numbers, running the whole pipeline in the context of the main thread.
zh_cn: 下面的示例打印前十个质数，在主线程的上下文中运行整个管道。

source: The following pipeline stage filters an incoming stream of numbers, removing all the numbers that are divisible by the given prime number:
zh_cn: 以下管道阶段过滤传入的数字流，删除可被给定质数整除的所有数字：

source: The general solution that works both for threads and for coroutines is to use a thread-safe (aka synchronized, linearizable, or atomic) data structure that provides all the necessary synchronization for the corresponding operations that needs to be performed on a shared state.
zh_cn: 适用于线程和协程的一般解决方案是使用线程安全(也称为同步、线性化或原子)的数据结构，为需要在共享状态下执行的相应操作提供所有必要的同步。

source: The iteration stops as soon as this close token is received, so there is a guarantee that all previously sent elements before the close are received:
zh_cn: 接收到此 close 指令时，迭代会停止，因此可以保证 close 之前发送的所有元素都能被接收到：

source: The key difference is that Mutex.lock() is a suspending function.
zh_cn: 主要关键在于 Mutex.lock() 是一个挂起函数。

source: The latter needs to send a response.
zh_cn: 后者需要发送响应。

source: The locking in this example is fine-grained, so it pays the price.
zh_cn: 本例中的锁定是细粒度的，因此需要付出代价（译注：指耗时较长）。

source: The main code is straightforward:
zh_cn: 主要代码很简单：

source: The main code starts and connects the whole pipeline:
zh_cn: 主代码启动并连接整个管道：

source: The main problem being synchronization of access to shared mutable state.
zh_cn: 主要问题是对 共享可变状态 的访问同步。

source: The original exception is handled by the parent only when all its children terminate, which is demonstrated by the following example.
zh_cn: 只有当父协程的所有子协程终止时，父协程才会处理原始异常，下面的示例演示了这一点。

source: The output is:
zh_cn: 输出为：

source: The output of this code is (with debug):
zh_cn: 此代码的输出是(使用 debug)：

source: The output of this code is:
zh_cn: 此代码的输出是：

source: The output will be similar to the the following one, albeit the processor ids that receive each specific integer may be different:
zh_cn: 虽然接收每个特定整数的处理器 id 可能不同，但输出将类似于以下输出：

source: The pattern where a coroutine is producing a sequence of elements is quite common.
zh_cn: 协程生成一系列元素的模式非常常见。

source: The problem
zh_cn: 问题

source: The program stops at the same breakpoint.
zh_cn: 程序在同一断点处停止。

source: The second coroutine has computed its value and disappeared.
zh_cn: 第二个协程计算了它的值，然后消失了。

source: The second coroutine is calculating the a value – it has the RUNNING status.
zh_cn: 第二个协程正在计算 a 值–它的状态为 RUNNING。

source: The third coroutine has the CREATED status and isn’t calculating the value of b.
zh_cn: 第三个协程有 CREATED 状态，并且没有计算 b 的值。

source: The third coroutine is calculating the value of b – it has the RUNNING status.
zh_cn: 第三个协程正在计算 b–它的状态为 RUNNING。

source: The tutorial assumes you have prior knowledge of the coroutines and Kotlin Flow concepts.
zh_cn: 本教程假设你已事先了解了 coroutines 和 Kotlin Flow 的概念。

source: The tutorial assumes you have prior knowledge of the coroutines concept.
zh_cn: 本教程假设你已事先了解了 coroutines 的概念。

source: Then we can have several processor coroutines.
zh_cn: 然后我们可以有几个处理器协程。

source: Then we define a function that launches an actor using an actor coroutine builder:
zh_cn: 然后，我们定义一个函数，该函数使用 actor 协程构建器启动 actor：

source: There is a common misconception that making a variable volatile solves concurrency problem.
zh_cn: 有一种常见的误解是，将变量设置为 volatile 可以解决并发问题。

source: There is a convenient coroutine builder named produce that makes it easy to do it right on producer side, and an extension function consumeEach, that replaces a for loop on the consumer side:
zh_cn: 因此为了方便提供一个名为 produce 的协程构建器，可轻松地在生产者端执行，还有一个扩展函数 consumeEach，可在消费者端替换 for 循环：

source: There is also withLock extension function that conveniently represents mutex.lock(); try { ... } finally { mutex.unlock() } pattern:
zh_cn: 还有 withLock 扩展函数，可以方便地表示 mutex.lock(); try { ... } finally { mutex.unlock() } 模式：

source: There is an actor coroutine builder that conveniently combines actor's mailbox channel into its scope to receive messages from and combines the send channel into the resulting job object, so that a single reference to the actor can be carried around as its handle.
zh_cn: 有一个 actor 协程构建器，可以方便地将 actor 的邮箱通道组合到其作用域中，以从中接收消息，并将发送通道组合到生成的作业对象中，这样就可以将对 actor 的单个引用作为其句柄。

source: They are served in first-in first-out order, e.g. the first coroutine to invoke receive gets the element.
zh_cn: 它们是以先进先出的顺序提供的，例如，调用 receive 的第一个协程获取元素。

source: This behaviour cannot be overridden and is used to provide stable coroutines hierarchies for structured concurrency.
zh_cn: 此行为无法覆盖，其用于为 structured concurrency 提供稳定的协程层次结构。

source: This can easily be demonstrated using the following example:
zh_cn: 这可以通过以下示例轻松演示：

source: This code works slower, but we still don't get "Counter = 100000" at the end, because volatile variables guarantee linearizable (this is a technical term for "atomic") reads and writes to the corresponding variable, but do not provide atomicity of larger actions (increment in our case).
zh_cn: 这段代码运行得比较慢，但我们最终还是没有得到“Counter=100000”，因为 volatile 变量保证对相应变量的读写是线性的(这是“原子”的技术术语)，但不提供更大操作的原子性(在我们的例子中是自增)。

source: This code works very slowly, because it does fine-grained thread-confinement.
zh_cn: 这段代码运行得非常慢，因为它执行 fine-grained (细粒度)的线程限制。

source: This difference comes from the fact that child's failure does not propagate to the parent.
zh_cn: 这种差异来自这样一个事实：子协程的失败不会传播给父协程。

source: This is a guide on core features of kotlinx.coroutines with a series of examples, divided up into different topics.
zh_cn: 这是一份 kotlinx.coroutines 的核心功能的指南，包含一系列示例，分为不同的主题。

source: This is a part of producer-consumer pattern that is often found in concurrent code.
zh_cn: 这是并发代码中常见的 producer-consumer (生产者 - 消费者) 模式的一部分。

source: This is the fastest solution for this particular problem.
zh_cn: 这是该特定问题的最快解决方案。

source: This now works much faster and produces correct result.
zh_cn: 现在，它的工作速度要快得多，并且也会产生正确的结果。

source: This section covers exception handling and cancellation on exceptions.
zh_cn: 本节介绍异常处理和异常取消。

source: This tutorial demonstrates how to create Kotlin Flow and debug it using IntelliJ IDEA.
zh_cn: 本教程演示如何创建 Kotlin 流，并使用 IntelliJ IDEA 进行调试。

source: This tutorial demonstrates how to create Kotlin coroutines and debug them using IntelliJ IDEA.
zh_cn: 本教程演示如何创建 Kotlin 协程，并使用 IntelliJ IDEA 对其进行调试。

source: Though it may seem to be useless standalone, it is a useful building block to create complex time-based produce pipelines and operators that do windowing and other time-dependent processing.
zh_cn: 虽然单独使用它似乎没什么用，但它是一个有用的构建块，可以创建复杂的基于时间的 生产 管道和执行窗口和其他依赖时间的处理的操作。

source: Thread confinement coarse-grained
zh_cn: 粗粒度线程限制

source: Thread confinement fine-grained
zh_cn: 细粒度线程限制

source: Thread-safe data structures
zh_cn: 线程安全数据结构

source: Ticker channel can be used in select to perform "on tick" action.
zh_cn: Ticker 通道可以在 select 中执行“on tick”操作。

source: Ticker channel is a special rendezvous channel that produces Unit every time given delay passes since last consumption from this channel.
zh_cn: Ticker 通道是一种特殊的会合通道，自上次使用消费该通道以后，每当经过给定的延迟，都会产生 Unit。

source: To create such channel use a factory method ticker.
zh_cn: 要创建这样的通道，请使用工厂方法 ticker。

source: To indicate that no further elements are needed use ReceiveChannel.cancel method on it.
zh_cn: 要表示不需要更多元素，请使用 ReceiveChannel.cancel 方法。

source: Unbuffered channels transfer elements when sender and receiver meet each other (aka rendezvous).
zh_cn: 无缓冲信道在发送方和接收方相遇时传输元素(也称为 rendezvous)。

source: Unlike consumeEach, this for loop pattern is perfectly safe to use from multiple coroutines.
zh_cn: 与 consumeEach 不同，这个 for 循环模式可以从多个协程中完全安全地使用。

source: Unlike a queue, a channel can be closed to indicate that no more elements are coming.
zh_cn: 与队列不同，通道可以被关闭，以表明没有更多元素进入。

source: Unlike many other languages with similar capabilities, async and await are not keywords in Kotlin and are not even part of its standard library.
zh_cn: 与许多其他具有类似功能的语言不同，async 和 await 在 Kotlin 中不是关键字，甚至不是其标准库的一部分。

source: Use the async() function to create coroutines that compute deferred values a and b.
zh_cn: 使用 async() 函数创建计算延迟值 a 和 b 的协程。

source: Use the await() function to await the computation result.
zh_cn: 使用 await() 函数等待计算结果。

source: Use the delay() function to imitate CPU-consuming blocking code.
zh_cn: 使用 delay() 函数来模拟消耗 CPU 的阻塞代码。

source: Use the delay() function to imitate CPU-consuming code.
zh_cn: 使用 delay() 函数来模拟消耗 CPU 的代码。

source: Use the println() function to print computing status and the result of multiplication to the output.
zh_cn: 使用 println() 函数将计算状态和乘法结果打印到输出。

source: Use the runBlocking() block to wrap a coroutine.
zh_cn: 使用 runBlocking() 块包装一个协程。

source: Using IntelliJ IDEA debugger, you can dig deeper into each coroutine to debug your code.
zh_cn: 使用 IntelliJ IDEA 调试器，你可以深入每个协程来调试代码。

source: Volatiles are of no help
zh_cn: Volatiles 没有作用

source: We already know that a cancelled coroutine throws CancellationException in suspension points and that it is ignored by the coroutines' machinery.
zh_cn: 我们已经知道，被取消的协程在挂起点中抛出 CancellationException，并且被协程的机制忽略。

source: We define CounterMsg sealed class with IncCounter message to increment a counter and GetCounter message to get its value.
zh_cn: 我们定义 CounterMsg 密封类，使用 IncCounter 消息递增计数器，使用 GetCounter 消息获取其值。

source: We start with a very simple action that increments a shared mutable variable using multi-threaded Dispatchers.Default.
zh_cn: 我们从一个非常简单的操作开始，该操作使用多线程 Dispatchers.Default，自增共享可变变量。

source: We start with an infinite sequence of numbers.
zh_cn: 我们从一个无限的数字序列开始。

source: We use cancelChildren extension function to cancel all the children coroutines after we have printed the first ten prime numbers.
zh_cn: 在打印出前十个质数后，我们使用 cancelChildren 扩展函数来取消所有子进程。

source: We'll also measure their completion time for further comparisons:
zh_cn: 我们还将测量它们的完成时间，以便进行进一步比较：

source: What does it print at the end?
zh_cn: 最后会打印什么？

source: When a coroutine is cancelled using Job.cancel, it terminates, but it does not cancel its parent.
zh_cn: 当使用 Job.cancel 取消协程时，它会终止，但不取消其父协程。

source: When multiple children of a coroutine fail with an exception, the general rule is "the first exception wins", so the first exception gets handled.
zh_cn: 当一个协程的多个子协程因异常而失败时，一般规则是“第一个异常获胜”，因此第一个异常得到处理。

source: When these builders are used to create a root coroutine, that is not a child of another coroutine, the former builders treat exceptions as uncaught exceptions, similar to Java's Thread.uncaughtExceptionHandler, while the latter are relying on the user to consume the final exception, for example via await or receive (produce and receive are covered in Channels section).
zh_cn: 当这些构建器用于创建一个 root (根) 协程，而不是另一个协程的子 子协程 时，前者的构建器将异常视为 uncaught 异常，类似于 Java 的 Thread.uncaughtExceptionHandler，而后者则依赖于用户消费最终的异常，例如通过 await 或 receive(produce 和 receive 在 Channels 部分中介绍)。

source: You can dig deeper into each coroutine to debug your code.
zh_cn: 你可以深入每个协程来调试代码。

source: You can get the full code here.
zh_cn: 你可以在 这里 获取完整代码。

source: You cannot recover from the exception in the CoroutineExceptionHandler.
zh_cn: 无法从 CoroutineExceptionHandler 中的异常中恢复。

source: You could abstract such a producer into a function that takes channel as its parameter, but this goes contrary to common sense that results must be returned from functions.
zh_cn: 你可以将这样一个生产者抽象为一个以通道为参数的函数，但这违背了必须从函数返回结果的常识。

source: You will not need runBlocking either.
zh_cn: 你将不需要 runBlocking。

source: single-threaded context.
zh_cn: 单线程上下文。
